# The <font color='red'>replace</font> function

The Pandas library provides highly flexible ways to manipulate strings. One of them is the <font color='red'>replace</font> function, under the <font color='red'>str</font> accessor. It can be used to replace a character or a sequence of characters in a string.

For instance, **line 5** in the following code snippet replaces the <font color='red'>,</font> in the <font color='red'>city</font> column with <font color='red'>-</font>.

In [10]:
import pandas as pd

staff = pd.read_csv("staff.csv")

print(staff["city"].str.replace(",", "-"))

0        Houston- TX
1       San Jose- CA
2         Dallas- TX
3          Miami- FL
4    Santa Clara- CA
5        Atlanta- GA
Name: city, dtype: object

In [3]:
staff['city']

0        Houston, TX
1       San Jose, CA
2         Dallas, TX
3          Miami, FL
4    Santa Clara, CA
5        Atlanta, GA
Name: city, dtype: object

In [6]:
print(staff["city"].str.replace(", ", " - "))

0        Houston - TX
1       San Jose - CA
2         Dallas - TX
3          Miami - FL
4    Santa Clara - CA
5        Atlanta - GA
Name: city, dtype: object

In the previous example, we used the <font color='red'>replace</font> function under the <font color='red'>str</font> accessor. The Pandas library also provides the <font color='red'>DataFrame.replace</font> function that can be used to replace entire values. Let’s look at an example with this <font color='red'>replace</font> function as well. We’ll first create a state column and then replace the abbreviations with actual state names.

In [7]:
import pandas as pd

staff = pd.read_csv("staff.csv")

# Create a state colum
staff["state"] = staff["city"].str[-2:]

# Replace state abbreviations with actual state names
staff["state"].replace(
    {"TX": "Texas", "CA": "California", "FL": "Florida", "GA": "Georgia"},
    inplace = True
)

print(staff["state"])

0         Texas
1    California
2         Texas
3       Florida
4    California
5       Georgia
Name: state, dtype: object

In [12]:
staff

,name,city,date_of_birth,start_date,salary,department
0,John Doe,"Houston, TX",1998-11-04,2018-08-11,"$65,000",Accounting
1,Jane Doe,"San Jose, CA",1995-08-05,2017-08-24,"$70,000",Field Quality
2,Matt smith,"Dallas, TX",1996-11-25,2020-04-16,"$58,500",human resources
3,Ashley Harris,"Miami, FL",1995-01-08,2021-02-11,"$49,500",accounting
4,Jonathan targett,"Santa Clara, CA",1998-08-14,2020-09-01,"$62,000",field quality
5,Hale Cole,"Atlanta, GA",2000-10-24,2021-10-20,"$54,500",engineering

In [14]:
staff["state"] = staff["city"].str[-2:]
staff["state"]

0    TX
1    CA
2    TX
3    FL
4    CA
5    GA
Name: state, dtype: object

The <font color='red'>inplace</font> parameter is set to <font color='red'>True</font> to save changes in the <font color='red'>DataFrame</font>.

It’s important to emphasize the difference between <font color='red'>str.replace</font> and <font color='red'>DataFrame.replace</font>:

1. **<font color='red'>str.replace</font>** can be used to replace a part of a string. We can replace one character, multiple characters, or the entire string.
2. **<font color='red'>DataFrame.replace</font>** can be used to replace the entire value. We can also use this function to replace values with other data types such as integer and boolean.